In [1]:
import numpy as np
import pandas as pd

In [43]:
df = pd.read_csv('AB_NYC_2019.csv',usecols=['name','price'])
df

                                                    name  price
0                     Clean & quiet apt home by the park    149
1                                  Skylit Midtown Castle    225
2                    THE VILLAGE OF HARLEM....NEW YORK !    150
3                        Cozy Entire Floor of Brownstone     89
4       Entire Apt: Spacious Studio/Loft by central park     80
...                                                  ...    ...
48890    Charming one bedroom - newly renovated rowhouse     70
48891      Affordable room in Bushwick/East Williamsburg     40
48892            Sunny Studio at Historical Neighborhood    115
48893               43rd St. Time Square-cozy single bed     55
48894  Trendy duplex in the very heart of Hell's Kitchen     90

[48895 rows x 2 columns]

In [45]:
df.price.describe()

count    48895.000000
mean       152.720687
std        240.154170
min          0.000000
25%         69.000000
50%        106.000000
75%        175.000000
max      10000.000000
Name: price, dtype: float64

In [46]:
max = df.price.quantile(0.999)
max

3000.0

In [47]:
min = df.price.quantile(0.01)
min

30.0

In [50]:
final_df = df[(df.price>min)&(df.price<max)]
final_df

                                                    name  price
0                     Clean & quiet apt home by the park    149
1                                  Skylit Midtown Castle    225
2                    THE VILLAGE OF HARLEM....NEW YORK !    150
3                        Cozy Entire Floor of Brownstone     89
4       Entire Apt: Spacious Studio/Loft by central park     80
...                                                  ...    ...
48890    Charming one bedroom - newly renovated rowhouse     70
48891      Affordable room in Bushwick/East Williamsburg     40
48892            Sunny Studio at Historical Neighborhood    115
48893               43rd St. Time Square-cozy single bed     55
48894  Trendy duplex in the very heart of Hell's Kitchen     90

[48183 rows x 2 columns]

In [51]:
finaldf.price.describe()

count    48183.000000
mean       148.772036
std        153.594795
min         31.000000
25%         70.000000
50%        110.000000
75%        179.000000
max       2999.000000
Name: price, dtype: float64